### Welcome Day 18 of 30 days python
  
Data Cleaning with Pandas  
- Removing duplicates
- Handling missing data (isnull, drop, fillna)
- Renaming and changing column datatypes

In [1]:
# importing libraries
import pandas as pd
import openpyxl
import xlrd
import numpy as np

In [112]:
# importing lib
import pandas as pd
import openpyxl
import xlrd
import numpy as np

In [2]:
data1 = {
        'sales_id': [101, 201, 101, 301, 301,], 
        'customer': ['Sam', 'John', 'Sam', 'Mike', 'Mike']
        }

df1 = pd.DataFrame(data1)

In [3]:
df1

   sales_id customer
0       101      Sam
1       201     John
2       101      Sam
3       301     Mike
4       301     Mike

In [5]:
df1[df1.duplicated()]

   sales_id customer
2       101      Sam
4       301     Mike

In [12]:
df1_new = df1.drop_duplicates()
df1_new

   sales_id customer
0       101      Sam
1       201     John
3       301     Mike

In [13]:
df1.drop_duplicates(inplace=True)
df1

   sales_id customer
0       101      Sam
1       201     John
3       301     Mike

In [6]:
df1.to_excel('test1.xlsx')

In [121]:
df1.to_excel('test1.xlsx')

In [130]:
df1

   sales_id customer
0       101      Sam
1       201     John
2       101      Sam
3       301     Mike
4       301     Mike

In [133]:
df1_new = df1.drop_duplicates(inplace=True)
df1_new
df1

   sales_id customer
0       101      Sam
1       201     John
2       101      Sam
3       301     Mike
4       301     Mike

In [134]:
df1.drop_duplicates(inplace=True)
df1

   sales_id customer
0       101      Sam
1       201     John
3       301     Mike

In [7]:
data2 = {
        'order_id': [1, 1, 2, 3], 
        'product': ['iPhone 14', 'iMac 15', 'iPhone 16', 'Airpods Pro']
        }

df2 = pd.DataFrame(data2)
df2

   order_id      product
0         1    iPhone 14
1         1      iMac 15
2         2    iPhone 16
3         3  Airpods Pro

In [10]:
df2[df2.duplicated(subset='order_id')]

   order_id  product
1         1  iMac 15

In [15]:
df2.drop_duplicates(subset='order_id', inplace=True)
df2

   order_id      product
0         1    iPhone 14
2         2    iPhone 16
3         3  Airpods Pro

In [139]:
df2.drop_duplicates(subset=['order_id', 'product'], inplace=True)
df2

   order_id      product
0         1    iPhone 14
1         1      iMac 15
2         2    iPhone 16
3         3  Airpods Pro

In [127]:
df2.duplicated

<bound method DataFrame.duplicated of    order_id      product
0         1    iPhone 14
1         1      iMac 15
2         2    iPhone 16
3         3  Airpods Pro>

In [125]:
df2[df2.duplicated(subset='order_id')]

   order_id  product
1         1  iMac 15

In [38]:
data3 = {
        'order_id': [1, 2, 3, 4, 5], 
        'product': ['iPhone 14', 'iMac 15', np.nan, 'Airpods Pro', 'iWatch'],
        'price' : [799, 1299, np.nan, np.nan, 499]
        }

df3 = pd.DataFrame(data3)
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [40]:
df3.fillna('missing')

   order_id      product    price
0         1    iPhone 14    799.0
1         2      iMac 15   1299.0
2         3      missing  missing
3         4  Airpods Pro  missing
4         5       iWatch    499.0

In [41]:
df3['price'].fillna(25)

0     799.0
1    1299.0
2      25.0
3      25.0
4     499.0
Name: price, dtype: float64

In [42]:
df3['price'].mean()

np.float64(865.6666666666666)

In [45]:
df3['price'].fillna(df3['price'].mean(), inplace=True)
df3

C:\Users\Administrator\AppData\Local\Temp\ipykernel_5552\3003536374.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3['price'].fillna(df3['price'].mean(), inplace=True)

   order_id      product        price
0         1    iPhone 14   799.000000
1         2      iMac 15  1299.000000
2         3          NaN   865.666667
3         4  Airpods Pro   865.666667
4         5       iWatch   499.000000

In [22]:
df4 = pd.read_excel('test1.xlsx')
df4

   Unnamed: 0  sales_id customer
0         0.0     101.0      Sam
1         1.0       NaN      NaN
2         NaN     101.0      Sam
3         3.0     301.0     Mike
4         4.0     301.0     Mike

In [23]:
df4.isnull()

   Unnamed: 0  sales_id  customer
0       False     False     False
1       False      True      True
2        True     False     False
3       False     False     False
4       False     False     False

In [24]:
df4.isnull().sum()

Unnamed: 0    1
sales_id      1
customer      1
dtype: int64

In [25]:
df4.isnull().sum().sum()

np.int64(3)

In [26]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      float64
 1   sales_id    4 non-null      float64
 2   customer    4 non-null      object
dtypes: float64(2), object(1)
memory usage: 252.0+ bytes

In [27]:
df4['sales_id'].isnull()

0    False
1     True
2    False
3    False
4    False
Name: sales_id, dtype: bool

In [46]:
data3 = {
        'order_id': [1, 2, 3, 4, 5], 
        'product': ['iPhone 14', 'iMac 15', np.nan, 'Airpods Pro', 'iWatch'],
        'price' : [799, 1299, np.nan, np.nan, 499]
        }

df3 = pd.DataFrame(data3)
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [47]:
df3.dropna(axis=0)

   order_id    product   price
0         1  iPhone 14   799.0
1         2    iMac 15  1299.0
4         5     iWatch   499.0

In [48]:
df3.dropna(axis=1)

   order_id
0         1
1         2
2         3
3         4
4         5

In [ ]:
# changing col names and data types

In [52]:
df3['order_id'] = df3['order_id'].astype(float)
df3

   order_id      product   price
0       1.0    iPhone 14   799.0
1       2.0      iMac 15  1299.0
2       3.0          NaN     NaN
3       4.0  Airpods Pro     NaN
4       5.0       iWatch   499.0

In [56]:
# changing column names

df3.rename(columns={'id':'p_id',
                    'product':'name',
                    'price':'total'}, 
                    inplace=True)
df3

   p_id         name   total
0   1.0    iPhone 14   799.0
1   2.0      iMac 15  1299.0
2   3.0          NaN     NaN
3   4.0  Airpods Pro     NaN
4   5.0       iWatch   499.0

In [49]:
df3.dtypes

order_id      int64
product      object
price       float64
dtype: object

In [30]:
df4.dropna(inplace=True)
df4

   Unnamed: 0  sales_id customer
0         0.0     101.0      Sam
3         3.0     301.0     Mike
4         4.0     301.0     Mike

In [36]:
df3.dropna(subset='product', inplace=True)
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [37]:
df3.fillna(0)

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
3         4  Airpods Pro     0.0
4         5       iWatch   499.0

In [171]:
df3.dropna(subset='product', inplace=True)

df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [173]:
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [178]:
df3['price'].mean()

np.float64(865.6666666666666)

In [185]:
df3['price'].fillna(df3['price'].mean(), inplace=True)
df3

   order_id      product        price
0         1    iPhone 14   799.000000
1         2      iMac 15  1299.000000
2         3          NaN   865.666667
3         4  Airpods Pro   865.666667
4         5       iWatch   499.000000

In [186]:
data3 = {
        'order_id': [1, 2, 3, 4, 5], 
        'product': ['iPhone 14', 'iMac 15', np.nan, 'Airpods Pro', 'iWatch'],
        'price' : [799, 1299, np.nan, np.nan, 499]
        }

df3 = pd.DataFrame(data3)
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [188]:
df3.dropna(axis=1)

   order_id
0         1
1         2
2         3
3         4
4         5

In [189]:
# changing col name and data types

In [207]:
df3['order_id'] = df3['order_id'].astype(float)
df3

   order_id      product   price
0       1.0    iPhone 14   799.0
1       2.0      iMac 15  1299.0
2       3.0          NaN     NaN
3       4.0  Airpods Pro     NaN
4       5.0       iWatch   499.0

In [191]:
df3.dtypes

order_id      int64
product      object
price       float64
dtype: object

changing colm name

In [215]:
df3

    id      product   price
0  1.0    iPhone 14   799.0
1  2.0      iMac 15  1299.0
2  3.0          NaN     NaN
3  4.0  Airpods Pro     NaN
4  5.0       iWatch   499.0

In [216]:
df3.rename(columns={'id': 'p_id',
                    'product': 'p_name',
                    'price' : 'total'}, 
           inplace=True)
df3

   p_id       p_name   total
0   1.0    iPhone 14   799.0
1   2.0      iMac 15  1299.0
2   3.0          NaN     NaN
3   4.0  Airpods Pro     NaN
4   5.0       iWatch   499.0